## Day 29 Lecture 1 Assignment

In this assignment, we will learn about decision trees. We will use the Chicago salary dataset loaded below.

In [1]:
%matplotlib inline

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
chicago = pd.read_csv('https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/Current_Employee_Names__Salaries__and_Position_Titles.csv')

In [3]:
chicago.head()

               Name      Job Titles  ... Annual Salary Hourly Rate
0  ALLISON,  PAUL W      LIEUTENANT  ...    $107790.00         NaN
1   BRUNO,  KEVIN D        SERGEANT  ...    $104628.00         NaN
2   COOPER,  JOHN E  LIEUTENANT-EMT  ...    $114324.00         NaN
3  CRESPO,  VILMA I      STAFF ASST  ...     $76932.00         NaN
4  DOLAN,  ROBERT J        SERGEANT  ...    $111474.00         NaN

[5 rows x 8 columns]

To simplify this problem, we will limit our model to only salary employees. Create a new dataset that does not contain any hourly employees.

In [4]:
# answer below:
chicago_s = chicago.loc[chicago['Salary or Hourly'] == 'Salary']
chicago_s

                        Name               Job Titles  ... Annual Salary Hourly Rate
0           ALLISON,  PAUL W               LIEUTENANT  ...    $107790.00         NaN
1            BRUNO,  KEVIN D                 SERGEANT  ...    $104628.00         NaN
2            COOPER,  JOHN E           LIEUTENANT-EMT  ...    $114324.00         NaN
3           CRESPO,  VILMA I               STAFF ASST  ...     $76932.00         NaN
4           DOLAN,  ROBERT J                 SERGEANT  ...    $111474.00         NaN
...                      ...                      ...  ...           ...         ...
32653     ZYGOWICZ,  PETER J           POLICE OFFICER  ...     $90024.00         NaN
32654  ZYLINSKA,  KATARZYNA            POLICE OFFICER  ...     $48078.00         NaN
32655      ZYMANTAS,  MARK E           POLICE OFFICER  ...     $87006.00         NaN
32656    ZYRKOWSKI,  CARLO E           POLICE OFFICER  ...     $93354.00         NaN
32657   ZYSKOWSKI,  DARIUSZ   CHIEF DATA BASE ANALYST  ...    $115932.00         NaN

[24775 rows x 8 columns]

Next, we will look at the count of all values for both job titles and department to ensure that we don't use features that are too sparse in our model.

In [5]:
# answer below:
chicago_s['Job Titles'].value_counts(ascending=False)

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
FIREFIGHTER                                564
                                          ...
PRINCIPAL BUDGET ANALYST                     1
DIRECTOR OF LEGAL SERVICES                   1
CONSUMER INVESTIGATOR I                      1
DEPUTY MANAGING EDITOR COUNCIL JOURNAL       1
FORENSIC FIREARM/EVIDENCE IDENT TECH         1
Name: Job Titles, Length: 954, dtype: int64

In [6]:
chicago_s['Department'].value_counts(ascending=False)

POLICE                   12941
FIRE                      4798
OEMC                       832
PUBLIC LIBRARY             708
AVIATION                   556
FINANCE                    532
HEALTH                     512
TRANSPORTN                 396
WATER MGMNT                366
LAW                        361
CITY COUNCIL               348
STREETS & SAN              321
FAMILY & SUPPORT           321
BUILDINGS                  266
COMMUNITY DEVELOPMENT      210
GENERAL SERVICES           205
BUSINESS AFFAIRS           160
BOARD OF ELECTION          112
DoIT                       101
PROCUREMENT                 82
CITY CLERK                  82
MAYOR'S OFFICE              78
HUMAN RESOURCES             67
CULTURAL AFFAIRS            66
INSPECTOR GEN               63
ANIMAL CONTRL               57
IPRA                        56
BUDGET & MGMT               43
ADMIN HEARNG                38
DISABILITIES                29
TREASURER                   23
COPA                        17
HUMAN RELATIONS             17
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

In [7]:
perc = (chicago_s.Department.value_counts().sum()/chicago_s.value_counts())
perc.sort_values(ascending=False)

Series([], dtype: float64)

In [8]:
jobs = ['POLICE OFFICER', 'FIREFIGHTER-EMT', 'SERGEANT', 'POLICE OFFICER (ASSIGNED AS DETECTIVE)', 'FIREFIGHTER']
depts = ['POLICE', 'FIRE', 'OEMC', 'PUBLIC LIBRARY', 'AVIATION']

chicago_df = chicago_s[
                       chicago_s['Job Titles'].isin(jobs) & 
                       chicago_s.Department.isin(depts)]
                  
chicago_df

                        Name      Job Titles  ... Annual Salary Hourly Rate
1            BRUNO,  KEVIN D        SERGEANT  ...    $104628.00         NaN
4           DOLAN,  ROBERT J        SERGEANT  ...    $111474.00         NaN
7            ELKINS,  ERIC J        SERGEANT  ...    $104628.00         NaN
8           ESTRADA,  LUIS F  POLICE OFFICER  ...     $96060.00         NaN
10             FINN,  SEAN P     FIREFIGHTER  ...     $87006.00         NaN
...                      ...             ...  ...           ...         ...
32652       ZYGMUNT,  DAWID   POLICE OFFICER  ...     $48078.00         NaN
32653     ZYGOWICZ,  PETER J  POLICE OFFICER  ...     $90024.00         NaN
32654  ZYLINSKA,  KATARZYNA   POLICE OFFICER  ...     $48078.00         NaN
32655      ZYMANTAS,  MARK E  POLICE OFFICER  ...     $87006.00         NaN
32656    ZYRKOWSKI,  CARLO E  POLICE OFFICER  ...     $93354.00         NaN

[13344 rows x 8 columns]

Choose between department and job title and use the variable with the smallest number of values to for one hot encoding. Additionally, create dummy variables for full or part-time.

In [9]:
chicago_df.Department.value_counts()

POLICE    11356
FIRE       1988
Name: Department, dtype: int64

In [10]:
chicago_df['Job Titles'].value_counts()

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
FIREFIGHTER                                564
Name: Job Titles, dtype: int64

In [11]:
dummied_chicago = pd.get_dummies(chicago_s, columns=['Department', 'Full or Part-Time'], drop_first=True)
dummied_chicago.head(3)

               Name  ... Full or Part-Time_P
0  ALLISON,  PAUL W  ...                   0
1   BRUNO,  KEVIN D  ...                   0
2   COOPER,  JOHN E  ...                   0

[3 rows x 42 columns]

Remove all irrelevant columns (Name, Job Titles, Salary or Hourly, Typical Hours, Hourly Rate)

In [12]:
# answer below:
dropped_chicago = dummied_chicago.drop(columns=['Name', 'Job Titles', 'Salary or Hourly', 'Typical Hours', 'Hourly Rate'])
dropped_chicago.head(3)

  Annual Salary  ...  Full or Part-Time_P
0    $107790.00  ...                    0
1    $104628.00  ...                    0
2    $114324.00  ...                    0

[3 rows x 37 columns]

Check that none of the remaining columns are of object type and convert them to numeric if they are of object type.

In [13]:
# answer below:
dropped_chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24775 entries, 0 to 32657
Data columns (total 37 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Annual Salary                     24775 non-null  object
 1   Department_ANIMAL CONTRL          24775 non-null  uint8
 2   Department_AVIATION               24775 non-null  uint8
 3   Department_BOARD OF ELECTION      24775 non-null  uint8
 4   Department_BOARD OF ETHICS        24775 non-null  uint8
 5   Department_BUDGET & MGMT          24775 non-null  uint8
 6   Department_BUILDINGS              24775 non-null  uint8
 7   Department_BUSINESS AFFAIRS       24775 non-null  uint8
 8   Department_CITY CLERK             24775 non-null  uint8
 9   Department_CITY COUNCIL           24775 non-null  uint8
 10  Department_COMMUNITY DEVELOPMENT  24775 non-null  uint8
 11  Department_COPA                   24775 non-null  uint8
 12  Department_CULTURAL AFFAIRS       24775 non-null  uint8
 13  Department_DISABILITIES           24775 non-null  uint8
 14  Department_DoIT                   24775 non-null  uint8
 15  Department_FAMILY & SUPPORT       24775 non-null  uint8
 16  Department_FINANCE                24775 non-null  uint8
 17  Department_FIRE                   24775 non-null  uint8
 18  Department_GENERAL SERVICES       24775 non-null  uint8
 19  Department_HEALTH                 24775 non-null  uint8
 20  Department_HUMAN RELATIONS        24775 non-null  uint8
 21  Department_HUMAN RESOURCES        24775 non-null  uint8
 22  Department_INSPECTOR GEN          24775 non-null  uint8
 23  Department_IPRA                   24775 non-null  uint8
 24  Department_LAW                    24775 non-null  uint8
 25  Department_LICENSE APPL COMM      24775 non-null  uint8
 26  Department_MAYOR'S OFFICE         24775 non-null  uint8
 27  Department_OEMC                   24775 non-null  uint8
 28  Department_POLICE                 24775 non-null  uint8
 29  Department_POLICE BOARD           24775 non-null  uint8
 30  Department_PROCUREMENT            24775 non-null  uint8
 31  Department_PUBLIC LIBRARY         24775 non-null  uint8
 32  Department_STREETS & SAN          24775 non-null  uint8
 33  Department_TRANSPORTN             24775 non-null  uint8
 34  Department_TREASURER              24775 non-null  uint8
 35  Department_WATER MGMNT            24775 non-null  uint8
 36  Full or Part-Time_P               24775 non-null  uint8
dtypes: object(1), uint8(36)
memory usage: 1.2+ MB

In [14]:
dropped_chicago['Annual Salary'] = dropped_chicago['Annual Salary'].str.replace('[\$,]', '', regex=True).astype(float)
#reviews3['Price'] = reviews3['Price'].str.replace('[\$,]', '', regex=True).astype(float)
dropped_chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24775 entries, 0 to 32657
Data columns (total 37 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Annual Salary                     24775 non-null  float64
 1   Department_ANIMAL CONTRL          24775 non-null  uint8
 2   Department_AVIATION               24775 non-null  uint8
 3   Department_BOARD OF ELECTION      24775 non-null  uint8
 4   Department_BOARD OF ETHICS        24775 non-null  uint8
 5   Department_BUDGET & MGMT          24775 non-null  uint8
 6   Department_BUILDINGS              24775 non-null  uint8
 7   Department_BUSINESS AFFAIRS       24775 non-null  uint8
 8   Department_CITY CLERK             24775 non-null  uint8
 9   Department_CITY COUNCIL           24775 non-null  uint8
 10  Department_COMMUNITY DEVELOPMENT  24775 non-null  uint8
 11  Department_COPA                   24775 non-null  uint8
 12  Department_CULTURAL AFFAIRS       24775 non-null  uint8
 13  Department_DISABILITIES           24775 non-null  uint8
 14  Department_DoIT                   24775 non-null  uint8
 15  Department_FAMILY & SUPPORT       24775 non-null  uint8
 16  Department_FINANCE                24775 non-null  uint8
 17  Department_FIRE                   24775 non-null  uint8
 18  Department_GENERAL SERVICES       24775 non-null  uint8
 19  Department_HEALTH                 24775 non-null  uint8
 20  Department_HUMAN RELATIONS        24775 non-null  uint8
 21  Department_HUMAN RESOURCES        24775 non-null  uint8
 22  Department_INSPECTOR GEN          24775 non-null  uint8
 23  Department_IPRA                   24775 non-null  uint8
 24  Department_LAW                    24775 non-null  uint8
 25  Department_LICENSE APPL COMM      24775 non-null  uint8
 26  Department_MAYOR'S OFFICE         24775 non-null  uint8
 27  Department_OEMC                   24775 non-null  uint8
 28  Department_POLICE                 24775 non-null  uint8
 29  Department_POLICE BOARD           24775 non-null  uint8
 30  Department_PROCUREMENT            24775 non-null  uint8
 31  Department_PUBLIC LIBRARY         24775 non-null  uint8
 32  Department_STREETS & SAN          24775 non-null  uint8
 33  Department_TRANSPORTN             24775 non-null  uint8
 34  Department_TREASURER              24775 non-null  uint8
 35  Department_WATER MGMNT            24775 non-null  uint8
 36  Full or Part-Time_P               24775 non-null  uint8
dtypes: float64(1), uint8(36)
memory usage: 1.2 MB

Split the data into a test and train sample. Use annual salary as the dependent variable. 20% of the data should be assigned to the test sample.

In [15]:
# answer below:
from sklearn.model_selection import train_test_split

y = dropped_chicago['Annual Salary']
X = dropped_chicago.drop(columns=['Annual Salary'])

X_train, X_test, y_train, y_test = train_test_split(X, y, random_state= 1, test_size=0.20)

Generate a regession decision tree using `DecisionTreeRegressor` in sklearn. Fit the model on the training set and calculate the score for both train and test.

In [16]:
# answer below:
from sklearn.tree import DecisionTreeRegressor

tree = DecisionTreeRegressor()
tree.fit(X_train, y_train)

print(f'Train score: {tree.score(X_train,y_train)}\n'f'Test score: {tree.score(X_test,y_test)}')

Train score: 0.14291491955809144
Test score: 0.15850199994292113